## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                      |
|--------|-------------------------------------------------------------------------------|
| update | `aws_athena_data_catalog.dynamodb`                                            |
|        | `aws_serverlessapplicationrepository_cloudformation_stack.dynamodb_connector` |
| add    | `aws_iam_role.athena_dynamodb_role`                                           |
|        | `aws_iam_role_policy.athena_dynamodb_policy`                                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_function.existing will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_function" "existing" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + code_signing_config_arn        = (known after apply)
      + dead_letter_config             = (known after apply)
      + description                    = (known after apply)
      + environment                    = (known after apply)
      + ephemeral_storage              = (known after apply)
      + file_system_config             = (known after apply)
      + function_name                  = "dynamodb-lambda-connector"
      + handler                        = (known after apply)
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + logging_config                 = (known after apply)
      + memory_size                    = (known after apply)
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = (known after apply)
      + role                           = (known after apply)
      + runtime                        = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + timeout                        = (known after apply)
      + tracing_config                 = (known after apply)
      + version                        = (known after apply)
      + vpc_config                     = (known after apply)
    }

  # aws_athena_data_catalog.dynamodb will be updated in-place
  ~ resource "aws_athena_data_catalog" "dynamodb" {
        id          = "dynamodb"
        name        = "dynamodb"
      ~ parameters  = {
          - "function" = "arn:aws:lambda:ca-central-1:957818836222:function:dynamodb-lambda-connector"
        } -> (known after apply)
        tags        = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.athena_dynamodb_role will be created
  + resource "aws_iam_role" "athena_dynamodb_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "athena_dynamodb_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.athena_dynamodb_policy will be created
  + resource "aws_iam_role_policy" "athena_dynamodb_policy" {
      + id          = (known after apply)
      + name        = "athena_dynamodb_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "glue:GetTableVersions",
                          + "glue:GetPartitions",
                          + "glue:GetTables",
                          + "glue:GetTableVersion",
                          + "glue:GetDatabases",
                          + "glue:GetTable",
                          + "glue:GetPartition",
                          + "glue:GetDatabase",
                          + "athena:GetQueryExecution",
                          + "s3:ListAllMyBuckets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:DescribeTable",
                          + "dynamodb:ListSchemas",
                          + "dynamodb:ListTables",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:PartiQLSelect",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ca-central-1:957818836222:table/AuditLogs"
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:ListBucket",
                          + "s3:GetBucketLocation",
                          + "s3:GetObjectVersion",
                          + "s3:PutObject",
                          + "s3:PutObjectAcl",
                          + "s3:GetLifecycleConfiguration",
                          + "s3:PutLifecycleConfiguration",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::gc-forms-production-athena-spill-bucket",
                          + "arn:aws:s3:::gc-forms-production-athena-spill-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_serverlessapplicationrepository_cloudformation_stack.dynamodb_connector will be updated in-place
  ~ resource "aws_serverlessapplicationrepository_cloudformation_stack" "dynamodb_connector" {
        id               = "arn:aws:cloudformation:ca-central-1:957818836222:stack/serverlessrepo-dynamodb-connector/7c50dfc0-45ca-11ef-b827-0eb1047e71d9"
        name             = "dynamodb-connector"
      ~ parameters       = {
          - "AthenaCatalogName" = "dynamodb-lambda-connector"
          - "SpillBucket"       = "gc-forms-production-athena-spill-bucket"
        } -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_form_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_nagware_invocations_schedule"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_response_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_submission_invocations_core_hours"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
